/* XMSG: Placeholder text in chart when there is no data */
"No Data" = "Dim Data";

/* XBUT: Save action in inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Save" = "Cadw";

/* XBUT: Re-enter action available in saved state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Re-enter Signature" = "Rhoi'r Llofnod eto";

/* XBUT: Clear action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Clear" = "Clirio";

/* XBUT: Cancel action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Cancel" = "Canslo";

/* XTIT: Title of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Signature" = "Llofnod";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Tap to Sign" = "Tapio i Lofnodi";

/* XACT: The accessibility label for the signature area */
"Signature Area" = "Man Llofnodi";

/* XACT: The accessibility hint for the signature area */
"Double tap and drag to sign" = "Tapiwch ddwywaith a llusgo i lofnodi";

/* XACT: The accessibility label for the signature image */
"Signature Image" = "Delwedd Llofnod";

/* XACT: The accessibility label for the signature line */
"Signature Line" = "Llinell Llofnodi";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Canceled" = "Wedi canslo";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Next" = "Nesaf";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Ok" = "Iawn";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Status" = "Statws";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"User canceled Onboarding" = "Y defnyddiwr wedi canslo proses Cynefino";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Without consent you will not be able to continue onboarding." = "Heb ganiatâd, fydd dim modd i chi fwrw ymlaen â'r broses cynefino.";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Give Consent" = "Rhoi caniatâd";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Quit" = "Gadael";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Back" = "Yn ôl";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Step" = "Cam";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"of" = "o";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Are you sure you want to quit the onboarding process?" = "Ydych chi'n siŵr eich bod am adael y broses cynefino?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Want Data Privacy?" = "Eisiau Preifatrwydd Data?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Be wise about your data" = "Byddwch yn ddoeth gyda'ch data";

/* XBUT: Not Now action title in UserConsentForm */
"Not Now" = "Dim nawr";

/* XBUT: Allow action title in UserConsentForm */
"Allow" = "Caniatáu";

/* XBUT: Deny action title in UserConsentForm */
"Deny" = "Gwrthod";

/* XBUT: Agree action title in EULAView */
"Agree" = "Cytuno";

/* XBUT: Disagree action title in EULAView */
"Disagree" = "Anghytuno";

/* XMSG: Placeholder text in DataTable for loading state */
"Loading..." = "Wrthi'n llwytho...";

/* XMSG: Placeholder text in DataTable when there is no data */
"There is nothing to display yet" = "Does dim i'w ddangos eto";

/* XBUT: Default duration foramtter in DataTable */
"%d Hrs %d Min" = "%d Awr %d Mun";

/* XBUT: Done action in keyboard toolbar for a Textfield in DataTable */
"Done" = "Wedi gwneud";

/* XBUT: Error messages shown to users in DataTable */
"There are %d errors in the data table." = "Mae %d gwall yn y tabl data.";

/* XBUT: voice over label for row header in DataTable */
"row header" = "pennyn rhes";

/* XBUT: voice over label for row %d in DataTable */
"row %d" = "rhes %d";

/* XBUT: voice over label for column %d in DataTable */
"column %d" = "colofn %d";

/* XBUT: voice over label for cell type of `leading accessory` in DataTable */
"leading accessory" = "ategolyn arweiniol";

/* XBUT: voice over label for cell type of `trailing accessory` in DataTable */
"trailing accessory" = "ategolyn ôl";

/* XBUT: voice over label for cell type of `text` in DataTable */
"text" = "testun";

/* XBUT: voice over label for cell type of `image` in DataTable */
"image" = "delwedd";

/* XBUT: voice over label for cell type of `date` in DataTable */
"date" = "dyddiad";

/* XBUT: voice over label for cell type of `time` in DataTable */
"time" = "amser";

/* XBUT: voice over label for cell type of `duration` in DataTable */
"duration" = "hyd";

/* XBUT: voice over label for cell type of `list item` in DataTable */
"list item" = "eitem rhestr";

/* XBUT: voice over label for row selection status in DataTable */
"selected" = "wedi dewis";

/* XBUT: voice over label for row selection status in DataTable */
"not selected" = "heb ei ddewis";

/* XBUT: calendar time component label */
"Time" = "Amser";

/* XBUT: slider default value label formatter for integer */
"Value: %d" = "Gwerth: %d";

/* XMSG: a toast message for read-only cell in DataTable */
"Tapped cell is read-only." = "Mae'r gell a gafodd ei thapio yn darllen-yn-unig";

/* Default hint text for Read-only Field for NoteFormView and TextFieldFormView */
"Read-only field" = "Maes darllen-yn-unig";

/* Default error text for when the character count reaches the maximum limit for NoteFormView and TextFieldFormView */
"No more characters remaining" = "Dim nodau ar ôl";

/* Default error text for when the character count exceeds the maximum limit for NoteFormView and TextFieldFormView */
"Reduce the number of characters" = "Lleihau nifer y nodau";

